<a href="https://colab.research.google.com/github/leonistor/ml-manning/blob/master/basics-ml-stack/ML_Stack_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ML Stack: Pandas

## Manual

In [5]:
import numpy as np

X = []

# data_2d.csv from https://github.com/lazyprogrammer/machine_learning_examples/raw/master/linear_regression_class/data_2d.csv

for line in open("data_2d.csv"):
    row = line.split(',')
    sample = list(map(float, row))
    X.append(sample)

X[:5]

[[17.9302012052, 94.5205919533, 320.259529602],
 [97.1446971852, 69.5932819844, 404.634471526],
 [81.7759007845, 5.73764809688, 181.485107741],
 [55.8543424175, 70.3259016768, 321.773638018],
 [49.3665499855, 75.1140401571, 322.465485583]]

In [6]:
X = np.array(X)
X.shape

(100, 3)

## Pandas

In [10]:
import pandas as pd

X = pd.read_csv("data_2d.csv", header=None)

type(X)

pandas.core.frame.DataFrame

In [12]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       100 non-null    float64
 1   1       100 non-null    float64
 2   2       100 non-null    float64
dtypes: float64(3)
memory usage: 2.5 KB

In [13]:
X.head()

           0          1           2
0  17.930201  94.520592  320.259530
1  97.144697  69.593282  404.634472
2  81.775901   5.737648  181.485108
3  55.854342  70.325902  321.773638
4  49.366550  75.114040  322.465486

## Select rows and columns

### indexing

In [18]:
# NOT like numpy
# X[0,0] -> ERROR
M = X.to_numpy()
type(M)

numpy.ndarray

In [20]:
# column 0
X[0]

# numpy: X[0] -> 0th row
# pandas: X[0] -> column with name 0

0     17.930201
1     97.144697
2     81.775901
3     55.854342
4     49.366550
        ...
95    46.456779
96    77.130301
97    68.600608
98    41.693887
99     4.142669
Name: 0, Length: 100, dtype: float64

In [22]:
type(X[0])

pandas.core.series.Series

### select

In [25]:
# integer location
X.iloc[0]

0     17.930201
1     94.520592
2    320.259530
Name: 0, dtype: float64

In [27]:
type(X.iloc[0])

pandas.core.series.Series

In [29]:
# 0th and 2nd columns
X[[0,2]]

            0           2
0   17.930201  320.259530
1   97.144697  404.634472
2   81.775901  181.485108
3   55.854342  321.773638
4   49.366550  322.465486
..        ...         ...
95  46.456779  336.876154
96  77.130301  438.460586
97  68.600608  355.900287
98  41.693887  284.834637
99   4.142669  168.034401

[100 rows x 2 columns]

In [32]:
# rows on criteria
X[ X[0] < 5 ]

           0          1           2
5   3.192702  29.256299   94.618811
44  3.593966  96.252217  293.237183
54  4.593463  46.335932  145.818745
90  1.382983  84.944087  252.905653
99  4.142669  52.254726  168.034401

In [33]:
X[0] < 5

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99     True
Name: 0, Length: 100, dtype: bool

In [34]:
type(X[0] < 5)

pandas.core.series.Series

## More select

In [0]:
# data: https://github.com/lazyprogrammer/machine_learning_examples/raw/master/airline/international-airline-passengers.csv

# pass engine to get skipfooter
df = pd.read_csv("international-airline-passengers.csv", engine='python', skipfooter=3)

In [38]:
df.columns

Index(['Month', 'International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60'], dtype='object')

In [40]:
df.columns = ["month", "passengers"]; df.columns

Index(['month', 'passengers'], dtype='object')

In [41]:
df.passengers

0      112
1      118
2      132
3      129
4      121
      ...
139    606
140    508
141    461
142    390
143    432
Name: passengers, Length: 144, dtype: int64

In [42]:
# add new column
df['ones'] = 1
df.head()

     month  passengers  ones
0  1949-01         112     1
1  1949-02         118     1
2  1949-03         132     1
3  1949-04         129     1
4  1949-05         121     1

## Apply

In [44]:
from datetime import datetime

datetime.strptime("1949-08", "%Y-%m")

datetime.datetime(1949, 8, 1, 0, 0)

In [47]:
# apply for rows, not columns (axis=0 default)!
df['dt'] = df.apply(lambda row: datetime.strptime(row['month'], "%Y-%m"), axis=1)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   month       144 non-null    object
 1   passengers  144 non-null    int64
 2   ones        144 non-null    int64
 3   dt          144 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 4.6+ KB

In [49]:
df.tail()

       month  passengers  ones         dt
139  1960-08         606     1 1960-08-01
140  1960-09         508     1 1960-09-01
141  1960-10         461     1 1960-10-01
142  1960-11         390     1 1960-11-01
143  1960-12         432     1 1960-12-01

## Join

use `merge()`